# Pivot

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [2]:
df=DataFrame({'Date':[1,2,3,1,2,3,1,2,3,1,2,3],'variable':['A','A','A','B','B','B','C','C','C','D','D','D'],'Dataset':np.random.randn(12)})

In [3]:
df

    Date variable   Dataset
0      1        A  2.534581
1      2        A -1.155433
2      3        A  0.744710
3      1        B -0.315812
4      2        B  0.000778
5      3        B  0.299789
6      1        C -1.047723
7      2        C  0.298919
8      3        C  0.445192
9      1        D  1.935990
10     2        D -0.649582
11     3        D  2.068424

In [4]:
df.pivot('Date','variable','Dataset') #pivot(1,2,3)  1st argument for index,2 for columns and 3 for matched values in dataframe

variable         A         B         C         D
Date
1         2.534581 -0.315812 -1.047723  1.935990
2        -1.155433  0.000778  0.298919 -0.649582
3         0.744710  0.299789  0.445192  2.068424

In [5]:
df.pivot('variable','Date','Dataset')

Date             1         2         3
variable
A         2.534581 -1.155433  0.744710
B        -0.315812  0.000778  0.299789
C        -1.047723  0.298919  0.445192
D         1.935990 -0.649582  2.068424

In [6]:
df1=DataFrame({'Student_sem':['sem-1','sem-2','sem-3','sem-1','sem-2','sem-3','sem-1','sem-2','sem-3','sem-1','sem-2','sem-3'],'Subject':['English','Hindi','Science','Maths','English','Hindi','Science','Maths','English','Hindi','Science','Maths',],'Marks':np.random.randint(50,100,12)})

In [7]:
df1

   Student_sem  Subject  Marks
0        sem-1  English     86
1        sem-2    Hindi     61
2        sem-3  Science     67
3        sem-1    Maths     52
4        sem-2  English     65
5        sem-3    Hindi     70
6        sem-1  Science     86
7        sem-2    Maths     81
8        sem-3  English     86
9        sem-1    Hindi     56
10       sem-2  Science     60
11       sem-3    Maths     50

In [16]:
df1.pivot('Student_sem','Subject','Marks')

Subject      English  Hindi  Maths  Science
Student_sem
sem-1             88     76     86       58
sem-2             91     58     66       83
sem-3             81     94     86       86

# Duplicates In DataFrame

In [17]:
df=DataFrame({'key1':['A','A','B','B','B'],'key2':[2,2,2,3,3]})

In [18]:
df

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [19]:
df.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [20]:
df['key1'].duplicated()

0    False
1     True
2    False
3     True
4     True
Name: key1, dtype: bool

In [21]:
df.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

In [22]:
df['key1'].drop_duplicates()

0    A
2    B
Name: key1, dtype: object

In [23]:
df.drop_duplicates('key1')

  key1  key2
0    A     2
2    B     2

In [24]:
df.drop_duplicates(['key1'],keep='last') #in keep=last it starts from bottom or last row to search duplicates

  key1  key2
1    A     2
4    B     3

In [25]:
df.drop_duplicates(['key1'])

  key1  key2
0    A     2
2    B     2

In [28]:
d={'Hritik':3,'Asif':3,'kartik':2,'Rudresh':0}

In [29]:
d

{'Hritik': 3, 'Asif': 3, 'kartik': 2, 'Rudresh': 0}

In [26]:
df=DataFrame({'Name':['Hritik','Asif','kartik','Rudresh'],'weight':[40,100,300,5]})

In [27]:
df

      Name  weight
0   Hritik      40
1     Asif     100
2   kartik     300
3  Rudresh       5

In [32]:
df['Height']=df['Name'].map(d) #to map values according to dictionary in new column height

In [33]:
df

      Name  weight  Height
0   Hritik      40       3
1     Asif     100       3
2   kartik     300       2
3  Rudresh       5       0